#include <stdio.h>

int main()
{
	int a[2][3]={1,2,3,4,5,6};//可以这样定义
	int b[3][4]={{1,2,3,4},{5,6,7,8},{9,10,11,12}};//也可以这样定义

	int c[3][4]= {
		{1,2,3,4},
		{5,6,7,8},
		{9,10,11,12}
	};//也可以定义成这个样子

	int d[3][3]={{1},{2},{3}};

	int e[][3]={1,2,3,4,5,6,7,8,9};//第一个维度可以不写，第二个一定要写

	for(int i = 0; i < 3; i++)
	{
		for(int j = 0;j < 3;j++)
		{
			printf("%-2d ",d[i][j]);
		}
		putchar('\n');
	}

	for(int i = 0; i < 3;i++)
	{
		for(int j = 0; j < 4; j++)
		{
			printf("%-2d ",b[i][j]);
		}
		putchar('\n');
	}

	
	return 0;
}
